a = input('Введите пятизначное натуральное число:')

if a[0] >= a[1] and a[0] >= a[2] and a[0] >= a[3] and a[0] >= a[-1]:
    print('Наибольшая цифра в вашем числе: ' + a[0])
elif a[1] >= a[0] and a[1] >= a[2] and a[1] >= a[3] and a[1] >= a[-1]:
    print('Наибольшая цифра в вашем числе: ' + a[1])
elif a[2] >= a[0] and a[2] >= a[1] and a[2] >= a[3] and a[2] >= a[-1]:
    print('Наибольшая цифра в вашем числе: ' + a[2])
elif a[3] >= a[0] and a[3] >= a[2] and a[3] >= a[1] and a[3] >= a[-1]:
    print('Наибольшая цифра в вашем числе: ' + a[3])
else:
    print('Наибольшая цифра в вашем числе: ' + a[-1])
